IDEA Open Model
OriginSettings Class
Compatible with IDEA StatiCa 20.1
 OriginProject
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OriginSettings
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class OriginSettings : OpenObject
Public Class OriginSettings
	Inherits OpenObject
The OriginSettings type exposes the following members.
Constructors
Name | Description
OriginSettings
 Constructor
Top
Properties
Name | Description
Author
 Name of author of project
CountryCode
 CountryCode
CrossSectionConversionTable
 Conversion table for Parameters
DateOfCreate
 Date of create project
ImportRecommendedWelds
 Import also recommended welds
ProjectDescription
 Description of project
ProjectName
 Name of project
Top
See Also
Reference
IdeaRS.OpenModel Namespace